Бух_тест/src/Documents/РегистрацияАвансовВНалоговомУчете/РегистрацияАвансовВНалоговомУчете.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегистрацияАвансовВНалоговомУчете</name>
  <comment>(Регл)</comment>
  <registerRecords>AccumulationRegister.ПродажиНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.ОжидаемыйИПодтвержденныйНДСПродаж</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ОжидаемыйИПодтвержденныйНДСПриобретений</registerRecords>
  <registerRecords>AccumulationRegister.ПриобретенияНалоговыйУчет</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Приобретения</name>
    <attributes>
      <name>Контрагент</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВозвратнаяТара</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидОперации</name>
      <type>
        <types>EnumRef.ВидыОперацийРегистрацияАвансовВНалоговомУчете</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетовРегл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БазаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДСВходящий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаНДС</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаНДСНеподтвержденный</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>РегистрацияПоНДС</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НалоговоеНазначение</name>
      <type>
        <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КратностьВзаиморасчетов</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсВзаиморасчетов</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСПропорциональноКредит</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Амортизируется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Продажи</name>
    <attributes>
      <name>Контрагент</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВозвратнаяТара</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидОперации</name>
      <type>
        <types>EnumRef.ВидыОперацийРегистрацияАвансовВНалоговомУчете</types>
      </type>
    </attributes>
    <attributes>
      <name>РегистрацияПоНДС</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетовРегл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БазаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаНДС</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаНДСНеподтвержденный</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КратностьВзаиморасчетов</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсВзаиморасчетов</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Возвраты</name>
    <attributes>
      <name>Контрагент</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВозвратнаяТара</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПревышениеОтгрузкиНадОплатой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеПредполагаетсяЗакрывающаяОперация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипКонтрагента</name>
      <comment>(Нал)</comment>
      <type>
        <types>EnumRef.СтатусыКонтрагентов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Бух_тест/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>НДС20</name>
    <comment>(Общ) Ставка НДС 20%</comment>
  </enumValues>
  <enumValues>
    <name>НДС7</name>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <comment>(Общ) Ставка НДС 0%</comment>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>НеНДС</name>
  </enumValues>
</mdclass:Enum>

Бух_тест/src/Documents/РегистрацияАвансовВНалоговомУчете/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ


// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Реестр документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Реестр";
	КомандаПечати.Представление = НСтр("ru='Реестр документов';uk='Реєстр документів'");
	КомандаПечати.ЗаголовокФормы= НСтр("ru='Реестр документов ""Регистрация авансов (неоперативный НДС)""';uk='Реєстр документів ""Реєстрація авансів (неоперативний ПДВ)""'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
	КомандаПечати.СписокФорм    = "ФормаСписка";
	КомандаПечати.Порядок       = 100;
	
КонецПроцедуры

#КонецЕсли

// Заполняет счета в строке табличной части
//
Процедура ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТЧ, ДанныеОбъекта, ИмяТабЧасти) Экспорт

	СчетаУчета = БухгалтерскийУчетРасчетовСКонтрагентами.ПолучитьСчетаРасчетовСКонтрагентом(ДанныеОбъекта.Организация, СтрокаТЧ.Контрагент, СтрокаТЧ.ДоговорКонтрагента);
	
	Если ИмяТабЧасти = "Приобретения" Тогда
		
		Если СтрокаТЧ.ВозвратнаяТара Тогда
			СтрокаТЧ.СтавкаНДС					  	= Перечисления.СтавкиНДС.НеНДС;
			СтрокаТЧ.СчетУчетаНДСНеподтвержденный	= ПланыСчетов.Хозрасчетный.ПустаяСсылка();
			СтрокаТЧ.СчетУчетаНДС				  	= ПланыСчетов.Хозрасчетный.ПустаяСсылка();
			СтрокаТЧ.НалоговоеНазначение 			= СчетаУчета.НалоговоеНазначениеПриобретенийПоТаре;
		Иначе	
			СтрокаТЧ.СтавкаНДС				  		= СчетаУчета.СтавкаНДСПриобретений;
			СтрокаТЧ.СчетУчетаНДСНеподтвержденный 	= СчетаУчета.СчетУчетаНДСПриобретений;
			СтрокаТЧ.СчетУчетаНДС				  	= СчетаУчета.СчетУчетаНДСПриобретенийПодтвержденный;
			СтрокаТЧ.НалоговоеНазначение 			= СчетаУчета.НалоговоеНазначениеПриобретений;
		КонецЕсли;
		
		Если НЕ СтрокаТЧ.ВалютаВзаиморасчетов = ДанныеОбъекта.ВалютаРегламентированногоУчета Тогда
			
			СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.НеНДС;
		
		КонецЕсли;		
		
	ИначеЕсли ИмяТабЧасти = "Продажи" Тогда
		
		Если СтрокаТЧ.ВозвратнаяТара Тогда
			СтрокаТЧ.СтавкаНДС					  	= Перечисления.СтавкиНДС.НеНДС;
			СтрокаТЧ.СчетУчетаНДСНеподтвержденный	= ПланыСчетов.Хозрасчетный.ПустаяСсылка();
			СтрокаТЧ.СчетУчетаНДС				  	= ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		Иначе	
			СтрокаТЧ.СтавкаНДС				  		= СчетаУчета.СтавкаНДСПродаж;
			СтрокаТЧ.СчетУчетаНДСНеподтвержденный 	= СчетаУчета.СчетУчетаНДСПродаж;
			СтрокаТЧ.СчетУчетаНДС				  	= СчетаУчета.СчетУчетаНДСПродажПодтвержденный;
		КонецЕсли;
		
		Если НЕ СтрокаТЧ.ВалютаВзаиморасчетов = ДанныеОбъекта.ВалютаРегламентированногоУчета Тогда
			
			СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.НДС0;
		
		КонецЕсли;		

	КонецЕсли;

КонецПроцедуры // ЗаполнитьСчетаУчетаВСтрокеТабЧасти()

Процедура РассчитатьКурсВСтрокеТабЧасти(СтрокаТЧ) Экспорт
	
	Если СтрокаТЧ.СуммаВзаиморасчетов <> 0 Тогда
	
		СтрокаТЧ.КурсВзаиморасчетов = СтрокаТЧ.СуммаВзаиморасчетовРегл / СтрокаТЧ.СуммаВзаиморасчетов;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура РассчитатьСуммуВзаиморасчетовРеглВСтрокеТабЧасти(СтрокаТЧ) Экспорт
	
	СтрокаТЧ.СуммаВзаиморасчетовРегл = СтрокаТЧ.СуммаВзаиморасчетов * СтрокаТЧ.КурсВзаиморасчетов / ?(СтрокаТЧ.КратностьВзаиморасчетов = 0, 1, СтрокаТЧ.КратностьВзаиморасчетов);
	
КонецПроцедуры

Процедура УстановитьКурсВзаиморасчетов(СтрокаТЧ, ДанныеОбъекта) Экспорт
	
	Если НЕ СтрокаТЧ.ВалютаВзаиморасчетов = ДанныеОбъекта.ВалютаРегламентированногоУчета Тогда
		
		ДанныеОВалюте = МодульВалютногоУчета.ПолучитьКурсВалюты(СтрокаТЧ.ВалютаВзаиморасчетов, ДанныеОбъекта.Дата);
		Курс = ДанныеОВалюте.Курс;
		Кратность = ДанныеОВалюте.Кратность;
		
	Иначе
		
		Курс 	  = 1;
		Кратность = 1;
		
	КонецЕсли;
	
	СтрокаТЧ.КурсВзаиморасчетов = Курс;
	СтрокаТЧ.КратностьВзаиморасчетов = Кратность;
	
КонецПроцедуры
